---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetFaces
source: html/75cb7394-3f9b-5aff-48cd-d097eb4553ba.htm
---
# Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetFaces Method

Gets the IfcFace handles created representing the processed geometry and stored in this object.

## Syntax (C#)
```csharp
public IList<ICollection<IFCAnyHandle>> GetFaces()
```

## Returns
The collection of face handles.